'''
-----------------------------------------------------
|	此課程程式包含：								 |
|	- Lecture22_Flask 網站開發 - 基礎環境建置教學.py |
|   - [資料夾]flask-heroku							|
-----------------------------------------------------
'''


# 流程
'''
1. 安裝 Flask 套件
2. 建立專案資料夾，撰寫程式
3. 啟動伺服器，測試網站運作
'''

#--------------------------------------------------------

# 安裝套件
# PIP 套件管理工具：安裝 Python 時，就一起安裝在電腦裡了
'''
# 安裝 Flask
pip install Flask
'''

#--------------------------------------------------------

# 建立網站專案
# 在電腦中任意位置建立[專案資料夾]

#--------------------------------------------------------

# 撰寫程式
# 撰寫第一支網站伺服器端(後端)的程式

#--------------------------------------------------------

# 執行測試
# 啟動網站
# 使用命令列執行 python 程式，即啟動網站

# 測試網站
# 將網址貼到瀏覽器中，測試網站運作